{
  "main": {
    "name":"GANs for Dogs & Cats",
    "description":"The purpose of this project was to create Dog & Cat images using a Generative Adversarial network",
    "github":"https://github.com/hjmok/GANs-for-Dog-Cat-Images",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/hojin-joseph-mok-31153a163/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/hjmok/GANs-for-Dog-Cat-Images",
        "className":"fa fa-github"
      }
    ]
  },
  "method":{
    "overview":[
      {
        "title":"GAN Basics",
        "description1a":"For this Deep Learning model, PyTorch was used for its flexibilty as we needed to create two neural networks: The Discriminator and The Generator. The basic idea will be that the Generator will create images of fake dogs and cats, and the Discriminator will be given both fake and real images to determine which dogs and cats are real. As the Discriminator gets better at distinguishing between real and fake images, the Generator will also improve by creating more realistic images over time.",
        "description1b":"The dataset consisted of 24,994 prelabelled photos, evenly split between dogs and cats. The dataset was taken from Kaggle's Dogs vs. Cats Dataset:",
	"description1d":"https://www.kaggle.com/c/dogs-vs-cats "
      },
      {	

	"title":"Discriminator Model",
        "description1a":"The purpose of the Discriminator is to classify between images of real and fake dogs and cats. As such, the Discriminator will be a Convolutional Neural Networking.",
        "description1b":"The CNN starts with a convolutional layer with 3 inputs. The hidden layer consists of 64, 128, 256, and 512 neurons, all using LeakyReLU as the activation function. The final output is determined by a Sigmoid function to decide whether the image was real or fake."
      },
      {
	"title":"Generator Model",
        "description1a":"The purpose of the Generator is to create fake images of the dogs and cats that become more realistic by using feedback from the Discriminator. As such, the model will be an inverse of a Convolutional Neural Network. ",
        "description1b":"This inverse CNN is layered with the following: 100, 512, 256, 128, 64, and 3. The activation function for the hidden layers were all ReLU, and the final output activation function is the hyperbolic tangent function. "
      },
      {
	"title":"Optimizer and Loss",
        "description1a":"For both neural networks, Adam optimizer was found to perform well. ",
        "description1b":"In addition, Binary Cross-Entropy loss was used since the final result will be a mutually exclusive binary answer (either real or fake, cannot be both)"
      }
    ]
  },
  "results":{
    "projects": [
      {
        "title":"Generator Result 1495",
        "category":"Epoch 1495",
        "image":"fake_samples_epoch_1495.png"
      },
      {
        "title":"Generator Result 1499",
        "category":"Epoch 1499",
        "image":"fake_samples_epoch_1499.png"
      },
      {
        "title":"Generator Result 1458",
        "category":"Epoch 1458",
        "image":"fake_samples_epoch_1458.png"
      },
      {
        "title":"Generator Result 1450",
        "category":"Epoch 1450",
        "image":"fake_samples_epoch_1450.png"
      }
    ]
  }
}
