{
  "main": {
    "name":"Bank Exit Prediction",
    "description":"In this project, an Artificial Neural Network is modeled to estimate if customers from three different countries are likely to leave a bank using supervised learning",
    "github":"https://github.com/hjmok/Bank-Exit-Prediction-with-ANN",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/hojin-joseph-mok-31153a163/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/hjmok/Bank-Exit-Prediction-with-ANN",
        "className":"fa fa-github"
      }
    ]
  },
  "method":{
    "overview":[
      {	
	"title":"Dataset and Library",
        "description1a":"Tensorflow was used as the main module for this model.",
        "description1b":"The dataset contains information on 10000 customers, including their geography, gender, age, credit score, estimated salary, and several other useful information. The label is whether the customer has exited the bank or not. However, the label is uneven with 7963 classified as staying and 2037 as exiting. The dataset be found from the following link:",
        "description1d":"https://www.kaggle.com/santoshd3/bank-customers"
      },
      {	
	"title":"Data Preprocessing",
        "description1a":"One of the important columns is Geography, which contain three countries: Spain, Germany, and France. However, the ANN model cannot process strings. As such, this column is One Hot Encoded so that there are three separate columns for each country, and a 0 or 1 to indicate which country the user belongs to.",
        "description1b":"Similarly, gender must also be encoded since it is given as just Male or Female. After encoding, female was assigned 0 and male was assigned 1.",
	"description1c":"The first three columns were excluded from acting as input for the model, which were Row Number, Customer ID, and Surname. This is because this information is not relevent when determining if the user will leave the bank or not. As such, the columns used for training were geography, credit score, gender, age, tenure, balance, number of products with the bank, if the user has a credit card with the bank, if the user is active, and estimated salary." 
      },     
      {	
	"title":"ANN Model",
        "description1a":"The hidden layers went in the order of 12, 12, and 6 neurons. In addition, a dropout rate of 5% was added to each hidden layer. The final output size was 1, using a Sigmoid activation function to predict whether the customer will stay or leave the bank.",
        "description1b":"A batch size of 16 was chosen, Adam was used as the model optimizer, and Binary Cross Entropy was used as the loss metric since this is a binary classification problem. Early stopping was implemented to stop the training if validation loss does not decrease after 40 epochs. For more information, please see my implementation on Github:",
	"description1c":"",
	"description1d":"https://github.com/hjmok/Bank-Exit-Prediction-with-ANN"
      }
    ]
  },
  "results":{
    "projects": [
      {
        "title":"Bank Exit Classification Report",
        "category":"",
        "image":"bank_cr.JPG"
      },
      {
        "title":"Bank Exit Confusion Matrix",
        "category":"",
        "image":"bank_cm.JPG"
      }
    ]
  }
}
