{
  "main": {
    "name":"Income Class Prediction",
    "description":"In this project, an Artificial Neural Network predicts whether an individual has an income above or below $50,000 USD using supervised learning",
    "github":"https://github.com/hjmok/Income-Class-Prediction-with-ANN",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/hojin-joseph-mok-31153a163/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"http://instagram.com/jindodooboo",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/hjmok/Income-Class-Prediction-with-ANN",
        "className":"fa fa-github"
      }
    ]
  },
  "method":{
    "overview":[
      {	
	"title":"Dataset and Library",
        "description1a":"PyTorch was used as the main module for this model.",
        "description1b":"The dataset contains information on 30000 adults, including their education level, occupation, age, marital-status, and several other useful information. The label is whether the individual is earning above or below $50,000 USD. However, the label is uneven with 21700 classified as below and 8300 as above $50,000 USD. The dataset be found from University of California Irvine Machine Learning repository:",
        "description1d":"http://archive.ics.uci.edu/ml/datasets/Adult"
      },
      {	
	"title":"Data Preprocessing",
        "description1a":"Firstly, the data had to be separated from categorical and continuous values. Continuous values included age and hours worked per week, which could directly be converted into tensors to act as inputs into the ANN.",
        "description1b":"However, categorical columns are all strings which cannot be used as input for the ANN. This includes the sex, education, marital-status, work class, and occupation columns. As such, these columns were all encoded so that they had a numerical value associated with each string, which can then be converted into a tensor to be fed into the ANN."
      },     
      {	
	"title":"ANN Model",
        "description1a":"The hidden layers went in the order of 192, 96, and 48 neurons. In addition, a dropout rate of 50% was added to each hidden layer. The final output size was 2, using a Sigmoid activation function to predict whether the individual makes above or below $50000.",
        "description1b":"The loss metric used was Cross Entropy Loss, since this is a mutually exclusive answer problem (label can either be above or below $50000, but not both). The Adam optimizer was used for the model. For more information, please see my implementation on Github:",
	"description1c":"",
	"description1d":"https://github.com/hjmok/Income-Class-Prediction-with-ANN"
      }
    ]
  },
  "results":{
    "projects": [
      {
        "title":"Income Cross Entropy Loss Plot",
        "category":"",
        "image":"income_loss.jpg"
      },
      {
        "title":"Income Test Results",
        "category":"",
        "image":"income_test.jpg"
      }
    ]
  }
}
